create database galyabase;

create table free_entries(
	entry timestamp	without time zone primary key
);

insert into free_entries (entry)
values ('2023-01-28 10:00:00'),
('2023-01-28 10:30:00'),
('2023-01-28 11:00:00'),
('2023-01-28 11:30:00'),
('2023-01-28 12:00:00'),
('2023-01-29 10:00:00'),
('2023-01-29 10:30:00'),
('2023-01-29 11:00:00'),
('2023-01-29 11:30:00'),
('2023-01-29 12:00:00'),
('2023-02-1 10:00:00'),
('2023-02-1 10:30:00'),
('2023-02-1 11:00:00'),
('2023-02-1 11:30:00'),
('2023-02-1 12:00:00'),
('2023-02-2 10:00:00'),
('2023-02-2 10:30:00'),
('2023-02-2 11:00:00'),
('2023-02-2 11:30:00'),
('2023-02-2 12:00:00');

create table client_list
(
	entry timestamp	without time zone primary key,
	firstname character varying(45),
	lastname character varying(45),
	middlename character varying(45),
	phone character varying(30)
);

insert into client_list(entry,firstname,lastname,middlename,phone)
values ('2023-01-05 10:00:00', 'Иван','Петров','Алексеевич','89999999123'),
('2023-01-05 10:30:00', 'Петр','Иванов','Владиморович','89999999122'),
('2023-01-05 11:00:00', 'Антон','Васильев','Валентинович','89999999121'),
('2023-01-07 10:00:00', 'Иван','Петров','Алексеевич','89999999123'),
('2023-02-05 10:00:00', 'Вадим','Вадимов','Вадимович','89999999124'),
('2023-02-06 10:30:00', 'Александр','Буякин','Петрович','89999999125'),
('2023-02-06 12:00:00', 'Екатерина','Хитрая','Вадимовна','89999999126'),
('2023-02-07 11:00:00', 'Леонид','Умный','Алексеевич','89999999127');

insert into client_list(entry,firstname,lastname,middlename,phone)
values ('2023-01-05 13:00:00', 'Иван','Петров','Алексеевич','89999999123')

select * from client_list
where entry > '2023-01-05 10:30:00'
order by (entry) asc;

delete from free_entries
where entry = '2023-02-2 12:00:00';



